In [15]:
import os
import pandas as pd
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql+psycopg2://superset:superset@localhost:5433/superset')

In [4]:
try:
    with engine.connect() as conn:
        print("Подключение к PostgreSQL успешно!")
except Exception as e:
    print(f"Ошибка подключения: {e}")
    exit()  # Прерываем выполнение, если нет подключения

Подключение к PostgreSQL успешно!

In [112]:
pd.read_sql_query("SELECT version()", engine)

                                             version
0  PostgreSQL 13.20 (Debian 13.20-1.pgdg120+1) on...

In [113]:
pd.read_sql_query("SELECT * FROM economic.rub_to_cny", engine)

Empty DataFrame
Columns: [date, cost]
Index: []

In [129]:
df = pd.read_excel('data_to_db/RUB_CNY.xlsx')

/home/user/projects/airflow-project/.venv/lib/python3.12/site-packages/openpyxl/styles/stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [130]:
df['curs'] = df['curs'] / df['nominal']

In [131]:
df = df[['data', 'curs']]

In [132]:
df

          data     curs
0   2025-04-30  11.2016
1   2025-04-29  11.2761
2   2025-04-26  11.3506
3   2025-04-25  11.3979
4   2025-04-24  11.3388
..         ...      ...
816 2022-01-15  11.9457
817 2022-01-14  11.7246
818 2022-01-13  11.7088
819 2022-01-12  11.7446
820 2022-01-11  11.7907

[821 rows x 2 columns]

In [133]:
df.describe()

                                data        curs
count                            821  821.000000
mean   2023-09-05 03:09:25.651644416   11.740421
min              2022-01-11 00:00:00    7.698460
25%              2022-11-03 00:00:00   10.867200
50%              2023-09-05 00:00:00   12.067200
75%              2024-07-06 00:00:00   12.797000
max              2025-04-30 00:00:00   19.041500
std                              NaN    1.837557

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 821 entries, 0 to 820
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    821 non-null    datetime64[ns]
 1   curs    821 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 13.0 KB

In [135]:
period_between = df.data.describe()[['min', 'max']]

In [136]:
all_days = pd.Series(pd.date_range(period_between['min'], period_between['max'], freq='D'), name='data')

In [137]:
all_days

0      2022-01-11
1      2022-01-12
2      2022-01-13
3      2022-01-14
4      2022-01-15
          ...
1201   2025-04-26
1202   2025-04-27
1203   2025-04-28
1204   2025-04-29
1205   2025-04-30
Name: data, Length: 1206, dtype: datetime64[ns]

In [138]:
df = pd.merge(df, all_days, how='outer', left_on='data', right_on='data')

In [139]:
df['curs'] = df.curs.ffill()

In [140]:
df.head(10)

        data     curs
0 2022-01-11  11.7907
1 2022-01-12  11.7446
2 2022-01-13  11.7088
3 2022-01-14  11.7246
4 2022-01-15  11.9457
5 2022-01-16  11.9457
6 2022-01-17  11.9457
7 2022-01-18  11.9798
8 2022-01-19  12.0180
9 2022-01-20  12.1011

In [141]:
df = df.rename(columns=({'curs' : 'cost', 'data': 'date'}))

In [142]:
df.to_sql('rub_to_cny', engine, if_exists='append', index=None, schema='economic')

206